# AssemblyMemberDifferentGeometry Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentGeometry Properties
AssemblyMemberDifferentGeometry Class See Also
---
The AssemblyMemberDifferentGeometry type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssemblyMemberDifference.) |

# See Also
AssemblyMemberDifferentGeometry Class
Autodesk.Revit.DB Namespace